; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v6 ?v1)
             (pred_5 ?v9 ?v10)
             (pred_7 ?v6 ?v10)
             (pred_6 ?v2 ?v6 )
	     (pred_10 ?v6)
             (pred_11 ?v7)
             (pred_8 ?v9)
             (pred_4 ?v10)
             (pred_3 ?v6)
             (pred_12 ?v9)
             (pred_1 ?v6)
             (pred_2 ))



(:action op_3
:parameters (?v8 ?v11 ?v4 ?v13)
:precondition (and (pred_11 ?v8) (pred_11 ?v11) (pred_8 ?v4) (pred_4 ?v13)
          (pred_9 ?v8 ?v11) (pred_5 ?v4 ?v13)
                   (pred_7 ?v11 ?v13) (pred_10 ?v8) 
                   (pred_3 ?v11) (pred_12 ?v4))
:effect (and  (pred_1 ?v11) (not (pred_3 ?v11))))


(:action op_5
:parameters (?v8 ?v5)
:precondition (and (pred_11 ?v8) (pred_11 ?v5)
               (pred_10 ?v8) (pred_9 ?v8 ?v5) (pred_1 ?v5))
:effect (and (pred_10 ?v5) (not (pred_10 ?v8))))

(:action op_4
:parameters (?v8 ?v4)
:precondition (and (pred_11 ?v8) (pred_8 ?v4) 
                  (pred_10 ?v8) (pred_6 ?v4 ?v8) (pred_2 ))
:effect (and (pred_12 ?v4)
   (not (pred_6 ?v4 ?v8)) (not (pred_2 ))))


(:action op_2
:parameters (?v8 ?v3 ?v12)
:precondition (and (pred_11 ?v8) (pred_8 ?v3) (pred_8 ?v12)
                  (pred_10 ?v8) (pred_12 ?v12) (pred_6 ?v3 ?v8))
:effect (and (pred_12 ?v3) (pred_6 ?v12 ?v8)
        (not (pred_12 ?v12)) (not (pred_6 ?v3 ?v8))))

(:action op_1
:parameters (?v8 ?v4)
:precondition (and (pred_11 ?v8) (pred_8 ?v4) 
                  (pred_10 ?v8) (pred_12 ?v4))
:effect (and (pred_2 ) (pred_6 ?v4 ?v8) (not (pred_12 ?v4)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_11 obj_15 obj_17 obj_20 obj_14 obj_06 obj_07 obj_02 obj_12 obj_16 obj_19 obj_10 obj_09 obj_05 obj_01 obj_08
    obj_03 obj_04
    obj_18 obj_13
    )

    (:init
       (pred_2)

       (pred_11 obj_11)
       (pred_11 obj_15)
       (pred_11 obj_17)
       (pred_11 obj_20)
       (pred_11 obj_14)
       (pred_11 obj_06)
       (pred_11 obj_07)
       (pred_11 obj_02)
       (pred_11 obj_12)
       (pred_11 obj_16)
       (pred_11 obj_19)
       (pred_11 obj_10)
       (pred_11 obj_09)
       (pred_11 obj_05)
       (pred_11 obj_01)
       (pred_11 obj_08)
       (pred_4 obj_03)
       (pred_4 obj_04)
       (pred_8 obj_18)
       (pred_8 obj_13)

       (pred_9 obj_11 obj_14)
       (pred_9 obj_11 obj_15)
       (pred_9 obj_15 obj_06)
       (pred_9 obj_15 obj_17)
       (pred_9 obj_15 obj_11)
       (pred_9 obj_17 obj_07)
       (pred_9 obj_17 obj_20)
       (pred_9 obj_17 obj_15)
       (pred_9 obj_20 obj_02)
       (pred_9 obj_20 obj_17)
       (pred_9 obj_14 obj_12)
       (pred_9 obj_14 obj_06)
       (pred_9 obj_14 obj_11)
       (pred_9 obj_06 obj_16)
       (pred_9 obj_06 obj_07)
       (pred_9 obj_06 obj_15)
       (pred_9 obj_06 obj_14)
       (pred_9 obj_07 obj_19)
       (pred_9 obj_07 obj_02)
       (pred_9 obj_07 obj_17)
       (pred_9 obj_07 obj_06)
       (pred_9 obj_02 obj_10)
       (pred_9 obj_02 obj_20)
       (pred_9 obj_02 obj_07)
       (pred_9 obj_12 obj_09)
       (pred_9 obj_12 obj_16)
       (pred_9 obj_12 obj_14)
       (pred_9 obj_16 obj_05)
       (pred_9 obj_16 obj_19)
       (pred_9 obj_16 obj_06)
       (pred_9 obj_16 obj_12)
       (pred_9 obj_19 obj_01)
       (pred_9 obj_19 obj_10)
       (pred_9 obj_19 obj_07)
       (pred_9 obj_19 obj_16)
       (pred_9 obj_10 obj_08)
       (pred_9 obj_10 obj_02)
       (pred_9 obj_10 obj_19)
       (pred_9 obj_09 obj_05)
       (pred_9 obj_09 obj_12)
       (pred_9 obj_05 obj_01)
       (pred_9 obj_05 obj_16)
       (pred_9 obj_05 obj_09)
       (pred_9 obj_01 obj_08)
       (pred_9 obj_01 obj_19)
       (pred_9 obj_01 obj_05)
       (pred_9 obj_08 obj_10)
       (pred_9 obj_08 obj_01)
       (pred_3 obj_20)
       (pred_3 obj_16)
       (pred_7  obj_20 obj_03)
       (pred_7  obj_16 obj_04)
       (pred_1 obj_11)
       (pred_1 obj_15)
       (pred_1 obj_17)
       (pred_1 obj_14)
       (pred_1 obj_06)
       (pred_1 obj_07)
       (pred_1 obj_02)
       (pred_1 obj_12)
       (pred_1 obj_19)
       (pred_1 obj_10)
       (pred_1 obj_09)
       (pred_1 obj_05)
       (pred_1 obj_01)
       (pred_1 obj_08)

       (pred_5  obj_18 obj_03)
       (pred_5  obj_13 obj_04)
       (pred_6 obj_18 obj_11)
       (pred_6 obj_13 obj_02)
       (pred_10 obj_14)
    )

    (:goal (and
       (pred_6 obj_13 obj_19)
    ))
(:constraints
  (always (not (pred_10 obj_07)))
)
)

; plan
1. (op_5 obj_14 obj_11)
   deleted: (pred_10 obj_14)
   added: (pred_10 obj_11)
   goals met: 0 of 1
2. (op_4 obj_11 obj_18)
   deleted: (pred_6 obj_18 obj_11) (pred_2)
   added: (pred_12 obj_18)
   goals met: 0 of 1
3. (op_5 obj_11 obj_15)
   deleted: (pred_10 obj_11)
   added: (pred_10 obj_15)
   goals met: 0 of 1
4. (op_5 obj_15 obj_17)
   deleted: (pred_10 obj_15)
   added: (pred_10 obj_17)
   goals met: 0 of 1
5. (op_3 obj_17 obj_20 obj_18 obj_03)
   deleted: (pred_3 obj_20)
   added: (pred_1 obj_20)
   goals met: 0 of 1
6. (op_5 obj_17 obj_20)
   deleted: (pred_10 obj_17)
   added: (pred_10 obj_20)
   goals met: 0 of 1
7. (op_5 obj_20 obj_02)
   deleted: (pred_10 obj_20)
   added: (pred_10 obj_02)
   goals met: 0 of 1
8. (op_2 obj_02 obj_13 obj_18)
   deleted: (pred_12 obj_18) (pred_6 obj_13 obj_02)
   added: (pred_12 obj_13) (pred_6 obj_18 obj_02)
   goals met: 0 of 1
9. (op_5 obj_02 obj_10)
   deleted: (pred_10 obj_02)
   added: (pred_10 obj_10)
   goals met: 0 of 1
10. (op_5 obj_10 obj_19)
   deleted: (pred_10 obj_10)
   added: (pred_10 obj_19)
   goals met: 0 of 1
11. (op_1 obj_19 obj_13)
   deleted: (pred_12 obj_13)
   added: (pred_2) (pred_6 obj_13 obj_19)
   goals met: 1 of 1
